{
    "question 1": "What is your age?",
    "option 1.1": "18-22 years old",
    "option 1.2": "23-26 years old",
    "option 1.3": "27-35 years old",
    "option 1.4": "Prefer not to say",
    "question 2": "Which of the following describe you, if any?",
    "option 2.1": "Man",
    "option 2.2": "Woman",
    "option 2.3": "Non-binary, genderqueer, or gender non-conforming",
    "option 2.4": "Prefer not to say",
    "question 3": "Are you of Hispanic/Latino/Spanish origin?",
    "option 3.1": "Yes",
    "option 3.2": "No",
    "question 4": "How would you best describe yourself?",
    "option 4.1": "American Indian or Alaska Native",
    "option 4.2": "Asian",
    "option 4.3": "Black or African American",
    "option 4.4": "Native Hawaiian or Other Pacific Islander",
    "option 4.5": "White",
    "question 5": "Which of the following best describes the highest level of formal education that you’ve completed or currently undergoing?",
    "option 5.1": "Bachelor’s degree (B.A., B.S., B.Tech, etc.)",
    "option 5.2": "Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",
    "option 5.3": "Professional degree (MD, Ph.D, Ed.D, etc.)",
    "question 6": "How many years of professional coding experience do you have?",
    "option 6.1": "Less than 1 year",
    "option 6.2": "1-2 years",
    "option 6.3": "3-5 years",
    "option 6.4": "6-10 years",
    "option 6.5": "More than 10 years",
    "question 7": "What is your preferred development environment?",
    "option 7.1": "Windows",
    "option 7.2": "macOS",
    "option 7.3": "Linux",
    "question 8": "How do you learn to code?",
    "option 8.1": "Online Courses or Certification",
    "option 8.2": "Books",
    "option 8.3": "School (i.e., University, College, etc.)",
    "option 8.4": "Coding Bootcamp",
    "option 8.5": "Leetcode",
    "option 8.6": "Documentation",
    "option 8.7": "Language specification and docs",
    "question 9": "What is the biggest challenge you face as a developer?",
    "option 9.1": "Keeping up with new technologies",
    "option 9.2": "Work-life balance",
    "option 9.3": "Understanding existing codebases",
    "option 9.4": "Time management",
    "question 10": "When choosing a programming language for a new project, you prioritize:",
    "option 10.1": "The language's performance and scalability",
    "option 10.2": "The development team's familiarity with the language",
    "option 10.3": "The language's community support and ecosystem",
    "option 10.4": "The specific requirements of the project",
    "option 10.5": "Working on multiple features and communicating with different stakeholders",
    "question 11": "How do you communicate effectively with teammates to collaborate while adhering to the timelines?",
    "option 11.1": "Use project management tools to assign tasks and track progress, ensuring everyone is aware of deadlines.",
    "option 11.2": "Schedule regular meetings for updates and coordination, but keep them concise.",
    "option 11.3": "Rely on informal chats and emails for quick updates, trusting team members.",
    "option 11.4": "Implement a combination of written documentation for clarity and regular communication.",
    "option 11.5": "Mostly over a platform like Teams.",
    "question 12": "How do you ensure that you stay up-to-date with industry changes as a software developer?",
    "option 12.1": "Regularly read industry blogs, websites, and journals to learn about the latest trends and technologies.",
    "option 12.2": "Attend workshops, conferences, and webinars to gain insights from industry leaders and peers.",
    "option 12.3": "Participate in online courses and certification programs to acquire new skills and knowledge.",
    "option 12.4": "Engage in open-source projects and coding communities to get hands-on experience with cutting-edge technologies.",
    "question 13": "How do you balance between innovation and meeting project deadlines?",
    "option 13.1": "Prioritize innovation over deadlines",
    "option 13.2": "Focus solely on meeting deadlines",
    "option 13.3": "Allocate specific time for research and innovation",
    "option 13.4": "Adjust project scopes to include innovation",
    "question 14": "Software development contributes to societal challenges by:",
    "option 14.1": "Improving healthcare through technology, such as telemedicine platforms and health tracking apps.",
    "option 14.2": "Enhancing education with e-learning platforms, interactive learning tools, and virtual classrooms.",
    "option 14.3": "Addressing climate change with environmental monitoring systems, carbon footprint calculators, and energy efficiency applications.",
    "option 14.4": "Supporting economic development through fintech solutions, e-commerce platforms, and digital marketplaces.",
    "question 15": "A company uses an AI system to monitor its employees' productivity. The AI suggests firing an employee based on low productivity, but the employee is going through a tough personal time. How should the company proceed?",
    "option 15.1": "Follow the AI’s suggestion and fire the employee",
    "option 15.2": "Ignore the AI’s suggestion and keep the employee",
    "option 15.3": "Use the AI’s suggestion as one of several factors in the decision",
    "question 16": "You're assigned to a project that requires expertise in a programming language you're not familiar with. The deadline is tight. What is your strategy to tackle this situation?",
    "option 16.1": "Spend time upfront to learn the basics of the language.",
    "option 16.2": "Use your existing knowledge and adapt as you go.",
    "option 16.3": "Seek assistance from a colleague who knows the language.",
    "option 16.4": "Suggest reallocating the project to someone with the necessary expertise.",
    "question 17": "You discover a critical bug right before a software release. What immediate action do you take?",
    "option 17.1": "Proceed with the release as planned and fix the bug in a subsequent patch.",
    "option 17.2": "Delay the release to assess and fix the bug, ensuring the product meets quality standards.",
    "option 17.3": "Release a limited beta version to a select group of users for further testing while addressing the bug.",
    "option 17.4": "Communicate with stakeholders about the issue and seek their input on how to proceed.",
    "question 18": "In a professional setting, if your team is supposed to deliver a SaaS product within a two-day timeframe, and you discover a critical bug in the software, how would you address and handle this situation?",
    "option 18.1": "Ignore the bug and proceed with the delivery as planned, with the intention of fixing the bug in the next update.",
    "option 18.2": "Inform your team leader or project manager about the bug immediately, and work collaboratively to assess its impact and decide on the next steps.",
    "option 18.3": "Delay the delivery without informing stakeholders to buy time for fixing the bug.",
    "option 18.4": "Document the bug and send an email to the client explaining the issue, suggesting a new timeline for delivery.",
    "option 18.5": "Prioritize the bug based on its severity and impact, and if it's critical, reallocate resources to fix it immediately, even if this means pushing back the delivery date."
}